app/views/poster/detail.html.erb

                            <!-- Comment Item -->
                            <% @poster.replies.each do |c| %>
---
SELECT "replies".* FROM "replies" WHERE "replies"."poster_id" = ?  [["poster_id", 4]]

                                        <div class="comment-author">
                                            <a href="#"><%= User.find(c.user_id).email %></a>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]