app/controllers/common_controller.rb

  def index
      @poster_index = Poster.take(3)
---
SELECT  "posters".* FROM "posters" LIMIT 3

  def mypage

    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]