app/controllers/poster_controller.rb

SELECT "posters".* FROM "posters"  ORDER BY posters.like desc
---
    def index
      @every_post=Poster.order("posters.like desc").all

INSERT INTO "posters" ("title", "intro", "host", "place", "user_id", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["title", "aws"], ["intro", "aws"], ["host", "제발"], ["place", "되라"], ["user_id", 2], ["image", "찜닭.jpg"], ["created_at", "2017-06-12 11:10:51.462007"], ["updated_at", "2017-06-12 11:10:51.462007"]]
INSERT INTO "tags" ("name") VALUES (?)  [["name", "하늘"]]
---
    def upload

      @user_id=Poster.new
      @user_id.title=params[:title]
      @user_id.intro=params[:intro]
      @user_id.host=params[:host]
      @user_id.place=params[:place]
      @user_id.title = params[:title]
      @user_id.user_id=current_user.id
      @user_id.category=params[:category]
      @user_id.start_date=params[:start_date]
      @user_id.end_date=params[:end_date]
      @user_id.tag_list.add(params[:tag_name], parse: true)
      @user_id.image= params[:image]


      @user_id.save

SELECT  "posters".* FROM "posters" WHERE "posters"."id" = ? LIMIT 1  [["id", 4]]
SELECT "like_posts".* FROM "like_posts" WHERE (poster_id = '4')
---
    def detail

        @poster = Poster.find(params[:id])


        if(@poster.category == 0)
                @category = "대외활동"
        elsif(@poster.category == 1)
                @category = "동아리"
        elsif(@poster.category == 2)
                 @category = "학과 행사"
        elsif(@poster.category ==3)
                 @category = "교내 행사"
        elsif(@poster.category == 4)
                 @category = "장학금"
        elsif(@poster.category == 5)
                 @category = "교외행사"
        elsif(@poster.category == 6)
                 @category = "기타"
        else
            @category = "error"
        end
        puts "like?"

        @like = LikePost.where("poster_id = ?", params[:id]).length

SELECT  "like_posts".* FROM "like_posts" WHERE "like_posts"."user_id" = ? AND "like_posts"."poster_id" = ? LIMIT 1  [["user_id", 1], ["poster_id", 4]]
INSERT INTO "like_posts" ("user_id", "poster_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["poster_id", 4], ["created_at", "2017-06-09 04:00:48.041486"], ["updated_at", "2017-06-09 04:00:48.041486"]]
DELETE FROM "like_posts" WHERE "like_posts"."id" = ?  [["id", 1]]
SELECT "like_posts".* FROM "like_posts" WHERE (poster_id = '4')
---
    def like

        like = LikePost.find_by(user_id: current_user.id ,
                                poster_id: params[:post_id])
        puts like
        if(like.nil?)
            #create
            puts "like"
            col = LikePost.new
            col.user_id = current_user.id
            col.poster_id = params[:post_id]
            col.save
        else
            puts "delete"
            like.destroy
        end
        #카운트가 플러스 일 해주는거
        @count =  LikePost.where("poster_id = ?", params[:post_id]).length

INSERT INTO "replies" ("user_id", "content", "poster_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["content", "ㅗㅑ"], ["poster_id", 4], ["created_at", "2017-06-09 04:00:55.152031"], ["updated_at", "2017-06-09 04:00:55.152031"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
    def reply

        @reply = Reply.new
        @reply.user_id = params[:user_id]
        @reply.content = params[:content]
        @reply.poster_id = params[:post_id]
        if @reply.save
            if request.xhr?
            render :json => {
                                :user_email => User.find(params[:user_id]).email

SELECT "posters".* FROM "posters"
---
    def best
        @every_post = Poster.all